Repository: benYahiaMohamed999/phone-Locked-Chebch
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Phone Repair Management
ar: إدارة إصلاح الهواتف

# loginTitle
source: Login
ar: تسجيل الدخول

# emailLabel
source: Email
ar: البريد الإلكتروني

# passwordLabel
source: Password
ar: كلمة المرور

# loginButton
source: Login
ar: دخول

# logoutButton
source: Logout
ar: تسجيل الخروج

source: Total Earnings
ar: إجمالي الأرباح

# unpaidRepairs
source: Unpaid
ar: غير المدفوعة

# paidRepairs
source: Paid
ar: المدفوعة

source: Date Range
ar: النطاق الزمني

source: Select Range
ar: اختر النطاق

source: From
ar: من

source: To
ar: إلى

# noPaidRepairs
source: No paid repairs found
ar: لا توجد إصلاحات مدفوعة

# noUnpaidRepairs
source: No unpaid repairs found
ar: لا توجد إصلاحات غير مدفوعة

source: Total Cost
ar: التكلفة الإجمالية

source: Total Selling Price
ar: سعر البيع الإجمالي

source: Profit
ar: الربح

# confirmDelete
source: Delete Repair
ar: حذف الإصلاح

# deleteRepairConfirmation
source: Are you sure you want to delete this repair? This action cannot be undone.
ar: هل أنت متأكد من حذف هذا الإصلاح؟ لا يمكن التراجع عن هذا الإجراء.

source: Add Repair
ar: إضافة إصلاح

source: Phone Model
ar: موديل الهاتف

# phoneModelRequired
source: Please enter the phone model
ar: الرجاء إدخال موديل الهاتف

source: Repair Details
ar: تفاصيل الإصلاح

# repairDetailsRequired
source: Please enter repair details
ar: الرجاء إدخال تفاصيل الإصلاح

# totalSellingPriceRequired
source: Please enter the total selling price
ar: الرجاء إدخال سعر البيع الإجمالي

# invalidPrice
source: Please enter a valid price
ar: الرجاء إدخال سعر صحيح

# repairUpdated
source: Repair updated successfully
ar: تم تحديث الإصلاح بنجاح

source: Save
ar: حفظ

source: Cancel
ar: إلغاء

source: Error
ar: خطأ

source: Success
ar: نجاح

source: Loading...
ar: جاري التحميل...

source: Delete
ar: حذف

# repairMarkedAsPaid
source: Repair marked as paid successfully
ar: تم تحديد الإصلاح كمدفوع بنجاح

# errorMarkingAsPaid
source: Error marking repair as paid
ar: خطأ في تحديد الإصلاح كمدفوع

# repairDeleted
source: Repair deleted successfully
ar: تم حذف الإصلاح بنجاح

source: Error deleting repair
ar: خطأ في حذف الإصلاح

source: Edit Repair
ar: تعديل الإصلاح

source: Part Cost
ar: تكلفة القطع (د.إ)

source: Service Cost
ar: تكلفة الخدمة (د.إ)

source: Mark as Paid
ar: تحديد كمدفوع

source: Dashboard
ar: لوحة التحكم

source: Add Part
ar: إضافة قطعة

source: Part Name
ar: اسم القطعة

source: Cost Price
ar: سعر التكلفة

source: Selling Price
ar: سعر البيع

source: Add
ar: إضافة

# partNameRequired
source: Part name is required
ar: اسم القطعة مطلوب

source: Invalid cost price
ar: سعر التكلفة غير صالح

source: Invalid selling price
ar: سعر البيع غير صالح

source: Repair Parts
ar: قطع الإصلاح

source: Part
ar: قطعة

source: Parts
ar: قطع

source: Total
ar: المجموع

# currency
source: USD
ar: د.إ

source: Settings
ar: الإعدادات

source: Appearance
ar: المظهر

source: Dark Mode
ar: الوضع الليلي

# darkModeDescription
source: Enable dark mode for better visibility in low-light conditions
ar: تفعيل الوضع الليلي لتحسين الرؤية في الظروف منخفضة الإضاءة

source: Language
ar: اللغة

source: English
ar: الإنجليزية

source: French
ar: الفرنسية

source: Arabic
ar: العربية

source: Account
ar: الحساب

source: Logout
ar: تسجيل الخروج

# logoutConfirmation
source: Are you sure you want to logout?
ar: هل أنت متأكد من رغبتك في تسجيل الخروج؟

source: Analytics
ar: التحليلات

# noRepairsFound
source: No repairs found for the selected date range
ar: لم يتم العثور على إصلاحات للنطاق الزمني المحدد

source: Total Repairs
ar: إجمالي الإصلاحات

source: Total Revenue
ar: إجمالي الإيرادات

source: Total Profit
ar: إجمالي الأرباح

# noParts
source: No parts added yet
ar: لم يتم إضافة قطع بعد

source: No Data
ar: لا توجد بيانات

source: Cost Paid
ar: تكلفة مدفوعة

source: Cost has been paid
ar: تم دفع التكلفة

source: Cost not paid yet
ar: التكلفة غير مدفوعة بعد

source: Done
ar: تم

source: Preset Models
ar: موديلات محددة مسبقًا

source: Custom Model
ar: موديل مخصص

source: Custom Phone Model
ar: موديل هاتف مخصص

# phoneModelExample
source: e.g. Xiaomi Mi 11
ar: مثال: شاومي مي 11

source: Select Phone Model
ar: اختر موديل الهاتف

# describeRepairNeeded
source: Describe the repair needed...
ar: وصف الإصلاح المطلوب...

# repairAlreadyPaid
source: This repair is already paid
ar: تم دفع هذا الإصلاح بالفعل

# repairNotPaidYet
source: This repair is not paid yet
ar: لم يتم دفع هذا الإصلاح بعد

source: Cost Pending
ar: التكلفة قيد الانتظار

source: Today
ar: اليوم

source: Yesterday
ar: أمس

source: This Week
ar: هذا الأسبوع

source: This Month
ar: هذا الشهر

source: Custom Range
ar: نطاق مخصص

# fieldRequired
source: This field is required
ar: هذا الحقل مطلوب

source: Add New Repair
ar: إضافة إصلاح جديد

# addAtLeastOnePart
source: Please add at least one repair part
ar: الرجاء إضافة قطعة إصلاح واحدة على الأقل

source: Client Name
ar: اسم العميل

# clientPhone
source: Client Phone Number
ar: رقم هاتف العميل

source: Client Name (Optional)
ar: اسم العميل (اختياري)

# clientPhoneOptional
source: Client Phone Number (Optional)
ar: رقم هاتف العميل (اختياري)

# clientInfo
source: Client Information
ar: معلومات العميل

# searchByClientPhoneModel
source: Search by client, phone, or model...
ar: بحث حسب العميل أو الهاتف أو الموديل...

# markAllAsPaid
source: Mark All Paid
ar: تعليم الكل كمدفوع

# confirmMarkAllPaid
source: Are you sure you want to mark all parts as paid?
ar: هل أنت متأكد أنك تريد تعليم جميع القطع كمدفوعة؟

# partDeleted
source: {partName} deleted
ar: تم حذف {partName}

# errorWithMessage
source: Error: {message}
ar: خطأ: {message}

source: Revenue
ar: الإيرادات

source: Daily
ar: يومي

source: Profit Trend
ar: اتجاه الربح

source: Loading analytics data...
ar: جاري تحميل بيانات التحليلات...

source: Error loading data
ar: خطأ في تحميل البيانات

# noRepairsForSelectedPeriod
source: No repairs found for selected period
ar: لم يتم العثور على إصلاحات للفترة المحددة

# noProfitDataAvailable
source: No profit data available for the selected period
ar: لا تتوفر بيانات ربح للفترة المحددة

# noRepairDataAvailable
source: No repair data available for the selected period
ar: لا تتوفر بيانات إصلاح للفترة المحددة

source: Repair Status
ar: حالة الإصلاح

# sevenD
source: 7D
ar: 7 أيام

# thirtyD
source: 30D
ar: 30 يوم

# ninetyD
source: 90D
ar: 90 يوم

source: YTD
ar: العام حتى تاريخه
